Revit 2026 API

# EndTreatmentTypeEndTreatment Property

---

String describing the end treatment

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string EndTreatment { get; set; }
```
```vb
Public Property EndTreatment As String
	Get
	Set
```
```cpp
public:
property String^ EndTreatment {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member EndTreatment : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

EndTreatmentType Class

Autodesk.Revit.DB.Structure Namespace